espressif/esp-idf/components/soc/esp32s31/register/soc/twaifd_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** TWAIFD_DEVICE_ID_VERSION_REG register
 *  TWAI FD device id status register
 */
#define TWAIFD_DEVICE_ID_VERSION_REG (DR_REG_TWAIFD_BASE + 0x0)
/** TWAIFD_DEVICE_ID : RO; bitpos: [15:0]; default: 51965;
 *  Represents whether CAN IP function is mapped correctly on its base address.
 */
#define TWAIFD_DEVICE_ID    0x0000FFFFU
#define TWAIFD_DEVICE_ID_M  (TWAIFD_DEVICE_ID_V << TWAIFD_DEVICE_ID_S)
#define TWAIFD_DEVICE_ID_V  0x0000FFFFU
#define TWAIFD_DEVICE_ID_S  0
/** TWAIFD_VER_MINOR : RO; bitpos: [23:16]; default: 4;
 *  TWAI FD IP version
 */
#define TWAIFD_VER_MINOR    0x000000FFU
#define TWAIFD_VER_MINOR_M  (TWAIFD_VER_MINOR_V << TWAIFD_VER_MINOR_S)
#define TWAIFD_VER_MINOR_V  0x000000FFU
#define TWAIFD_VER_MINOR_S  16
/** TWAIFD_VER_MAJOR : RO; bitpos: [31:24]; default: 2;
 *  TWAI FD IP version
 */
#define TWAIFD_VER_MAJOR    0x000000FFU
#define TWAIFD_VER_MAJOR_M  (TWAIFD_VER_MAJOR_V << TWAIFD_VER_MAJOR_S)
#define TWAIFD_VER_MAJOR_V  0x000000FFU
#define TWAIFD_VER_MAJOR_S  24

/** TWAIFD_MODE_SETTINGS_REG register
 *  TWAI FD mode setting register
 */
#define TWAIFD_MODE_SETTINGS_REG (DR_REG_TWAIFD_BASE + 0x4)
/** TWAIFD_RST : WO; bitpos: [0]; default: 0;
 *  Soft reset. Writing logic 1 resets CTU CAN FD. After writing logic 1, logic 0 does
 *  not need to be written, this bit
 *  is automatically cleared.
 *  0: invalid
 *  1: reset.
 */
#define TWAIFD_RST    (BIT(0))
#define TWAIFD_RST_M  (TWAIFD_RST_V << TWAIFD_RST_S)
#define TWAIFD_RST_V  0x00000001U
#define TWAIFD_RST_S  0
/** TWAIFD_BMM : R/W; bitpos: [1]; default: 0;
 *  Bus monitoring mode. In this mode CTU CAN FD only receives frames and sends only
 *  recessive bits on CAN
 *  bus. When a dominant bit is sent, it is re-routed internally so that bus value is
 *  not changed. When this mode is
 *  enabled, CTU CAN FD will not transmit any frame from TXT Buffers,
 *  0b0 - BMM_DISABLED - Bus monitoring mode disabled.
 *  0b1 - BMM_ENABLED - Bus monitoring mode enabled.
 */
#define TWAIFD_BMM    (BIT(1))
#define TWAIFD_BMM_M  (TWAIFD_BMM_V << TWAIFD_BMM_S)
#define TWAIFD_BMM_V  0x00000001U
#define TWAIFD_BMM_S  1
/** TWAIFD_STM : R/W; bitpos: [2]; default: 0;
 *  Self Test Mode. In this mode transmitted frame is considered valid even if dominant
 *  acknowledge was not received.
 *  0b0 - STM_DISABLED - Self test mode disabled.
 *  0b1 - STM_ENABLED - Self test mode enabled.
 */
#define TWAIFD_STM    (BIT(2))
#define TWAIFD_STM_M  (TWAIFD_STM_V << TWAIFD_STM_S)
#define TWAIFD_STM_V  0x00000001U
#define TWAIFD_STM_S  2
/** TWAIFD_AFM : R/W; bitpos: [3]; default: 0;
 *  Acceptance Filters Mode. If enabled, only RX frames which pass Frame filters are
 *  stored in RX buffer. If disabled,
 *  every received frame is stored to RX buffer. This bit has meaning only if there is
 *  at least one filter available.
 *  Otherwise, this bit is reserved.
 *  0b0 - AFM_DISABLED - Acceptance filter mode disabled
 *  0b1 - AFM_ENABLED - Acceptance filter mode enabled
 */
#define TWAIFD_AFM    (BIT(3))
#define TWAIFD_AFM_M  (TWAIFD_AFM_V << TWAIFD_AFM_S)
#define TWAIFD_AFM_V  0x00000001U
#define TWAIFD_AFM_S  3
/** TWAIFD_FDE : R/W; bitpos: [4]; default: 1;
 *  Flexible data rate enable. When flexible data rate is enabled CTU CAN FD recognizes
 *  CAN FD frames (FDF bit
 *  = 1).
 *  0b0 - FDE_DISABLE - Flexible data-rate support disabled.
 *  0b1 - FDE_ENABLE - Flexible data-rate support enabled.
 */
#define TWAIFD_FDE    (BIT(4))
#define TWAIFD_FDE_M  (TWAIFD_FDE_V << TWAIFD_FDE_S)
#define TWAIFD_FDE_V  0x00000001U
#define TWAIFD_FDE_S  4
/** TWAIFD_TTTM : R/W; bitpos: [5]; default: 0;
 *  Time triggered transmission mode.
 *  0b0 - TTTM_DISABLED -
 *  0b1 - TTTM_ENABLED -
 */
#define TWAIFD_TTTM    (BIT(5))
#define TWAIFD_TTTM_M  (TWAIFD_TTTM_V << TWAIFD_TTTM_S)
#define TWAIFD_TTTM_V  0x00000001U
#define TWAIFD_TTTM_S  5
/** TWAIFD_ROM : R/W; bitpos: [6]; default: 0;
 *  Restricted operation mode.
 *  0b0 - ROM_DISABLED - Restricted operation mode is disabled.
 *  0b1 - ROM_ENABLED - Restricted operation mode is enabled.
 */
#define TWAIFD_ROM    (BIT(6))
#define TWAIFD_ROM_M  (TWAIFD_ROM_V << TWAIFD_ROM_S)
#define TWAIFD_ROM_V  0x00000001U
#define TWAIFD_ROM_S  6
/** TWAIFD_ACF : R/W; bitpos: [7]; default: 0;
 *  Acknowledge Forbidden Mode. When enabled, acknowledge is not sent even if received
 *  CRC matches the calculated
 *  one.
 *  0b0 - ACF_DISABLED - Acknowledge forbidden mode disabled.
 *  0b1 - ACF_ENABLED - Acknowledge forbidden mode enabled.
 */
#define TWAIFD_ACF    (BIT(7))
#define TWAIFD_ACF_M  (TWAIFD_ACF_V << TWAIFD_ACF_S)
#define TWAIFD_ACF_V  0x00000001U
#define TWAIFD_ACF_S  7
/** TWAIFD_TSTM : R/W; bitpos: [8]; default: 0;
 *  Test Mode. In test mode several registers have special features. Refer to
 *  description of Test mode for further
 *  Details.
 */
#define TWAIFD_TSTM    (BIT(8))
#define TWAIFD_TSTM_M  (TWAIFD_TSTM_V << TWAIFD_TSTM_S)
#define TWAIFD_TSTM_V  0x00000001U
#define TWAIFD_TSTM_S  8
/** TWAIFD_RXBAM : R/W; bitpos: [9]; default: 1;
 *  RX Buffer automatic mode.
 *  0b0 - RXBAM_DISABLED -
 *  0b1 - RXBAM_ENABLED -
 */
#define TWAIFD_RXBAM    (BIT(9))
#define TWAIFD_RXBAM_M  (TWAIFD_RXBAM_V << TWAIFD_RXBAM_S)
#define TWAIFD_RXBAM_V  0x00000001U
#define TWAIFD_RXBAM_S  9
/** TWAIFD_TXBBM : R/W; bitpos: [10]; default: 0;
 *  TXT Buffer Backup mode
 *  0b0 - TXBBM_DISABLED - TXT Buffer Backup mode disabled
 *  0b1 - TXBBM_ENABLED - TXT Buffer Backup mode enabled
 */
#define TWAIFD_TXBBM    (BIT(10))
#define TWAIFD_TXBBM_M  (TWAIFD_TXBBM_V << TWAIFD_TXBBM_S)
#define TWAIFD_TXBBM_V  0x00000001U
#define TWAIFD_TXBBM_S  10
/** TWAIFD_SAM : R/W; bitpos: [11]; default: 0;
 *  Self-acknowledge mode.
 *  0b0 - SAM_DISABLE - Do not send dominant ACK bit when CTU CAN FD sends Acknowledge
 *  bit.
 *  0b1 - SAM_ENABLE - Send dominant ACK bit when CTU CAN FD transmits CAN frame.
 */
#define TWAIFD_SAM    (BIT(11))
#define TWAIFD_SAM_M  (TWAIFD_SAM_V << TWAIFD_SAM_S)
#define TWAIFD_SAM_V  0x00000001U
#define TWAIFD_SAM_S  11
/** TWAIFD_RTRLE : R/W; bitpos: [16]; default: 0;
 *  Retransmitt Limit Enable. If enabled, CTU CAN FD only attempts to retransmitt each
 *  frame up to RTR_TH
 *  times.
 *  0b0 - RTRLE_DISABLED - Retransmitt limit is disabled.
 *  0b1 - RTRLE_ENABLED - Retransmitt limit is enabled.
 */
#define TWAIFD_RTRLE    (BIT(16))
#define TWAIFD_RTRLE_M  (TWAIFD_RTRLE_V << TWAIFD_RTRLE_S)
#define TWAIFD_RTRLE_V  0x00000001U
#define TWAIFD_RTRLE_S  16
/** TWAIFD_RTRTH : R/W; bitpos: [20:17]; default: 0;
 *  Retransmitt Limit Threshold. Maximal amount of retransmission attempts when
 *  SETTINGS[RTRLE] is en-
 *  Abled.
 */
#define TWAIFD_RTRTH    0x0000000FU
#define TWAIFD_RTRTH_M  (TWAIFD_RTRTH_V << TWAIFD_RTRTH_S)
#define TWAIFD_RTRTH_V  0x0000000FU
#define TWAIFD_RTRTH_S  17
/** TWAIFD_ILBP : R/W; bitpos: [21]; default: 0;
 *  Internal Loop Back mode. When enabled, CTU CAN FD receives any frame it transmits.
 *  0b0 - INT_LOOP_DISABLED - Internal loop-back is disabled.
 *  0b1 - INT_LOOP_ENABLED - Internal loop-back is enabled.
 */
#define TWAIFD_ILBP    (BIT(21))
#define TWAIFD_ILBP_M  (TWAIFD_ILBP_V << TWAIFD_ILBP_S)
#define TWAIFD_ILBP_V  0x00000001U
#define TWAIFD_ILBP_S  21
/** TWAIFD_ENA : R/W; bitpos: [22]; default: 0;
 *  Main enable bit of CTU CAN FD. When enabled, CTU CAN FD communicates on CAN bus.
 *  When disabled, it
 *  is bus-off and does not take part of CAN bus communication.
 *  0b0 - CTU_CAN_DISABLED - The CAN Core is disabled.
 *  0b1 - CTU_CAN_ENABLED - The CAN Core is enabled.
 */
#define TWAIFD_ENA    (BIT(22))
#define TWAIFD_ENA_M  (TWAIFD_ENA_V << TWAIFD_ENA_S)
#define TWAIFD_ENA_V  0x00000001U
#define TWAIFD_ENA_S  22
/** TWAIFD_NISOFD : R/W; bitpos: [23]; default: 0;
 *  Non ISO FD. When this bit is set, CTU CAN FD is compliant to NON-ISO CAN FD
 *  specification (no stuff
 *  count field). This bit should be modified only when SETTINGS[ENA]=0.
 *  0b0 - ISO_FD - The CAN Controller conforms to ISO CAN FD specification.
 *  0b1 - NON_ISO_FD - The CAN Controller conforms to NON ISO CAN FD specification.
 *  CANFD 1.0
 */
#define TWAIFD_NISOFD    (BIT(23))
#define TWAIFD_NISOFD_M  (TWAIFD_NISOFD_V << TWAIFD_NISOFD_S)
#define TWAIFD_NISOFD_V  0x00000001U
#define TWAIFD_NISOFD_S  23
/** TWAIFD_PEX : R/W; bitpos: [24]; default: 0;
 *  Protocol exception handling. When this bit is set, CTU CAN FD will start
 *  integration upon detection of protocol
 *  exception. This should be modified only when SETTINGS[ENA] = ’0’.
 *  0b0 - PROTOCOL_EXCEPTION_DISABLED - Protocol exception handling is disabled.
 *  0b1 - PROTOCOL_EXCEPTION_ENABLED - Protocol exception handling is enabled.
 */
#define TWAIFD_PEX    (BIT(24))
#define TWAIFD_PEX_M  (TWAIFD_PEX_V << TWAIFD_PEX_S)
#define TWAIFD_PEX_V  0x00000001U
#define TWAIFD_PEX_S  24
/** TWAIFD_TBFBO : R/W; bitpos: [25]; default: 1;
 *  All TXT buffers shall go to "TX failed" state when CTU CAN FD becomes bus-off.
 *  0b0 - TXTBUF_FAILED_BUS_OFF_DISABLED - TXT Buffers dont go to "TX failed" state
 *  when CTU CAN
 *  FD becomes bus-off.
 *  0b1 - TXTBUF_FAILED_BUS_OFF_ENABLED - TXT Buffers go to "TX failed" state when CTU
 *  CAN FD
 *  becomes bus-off.
 */
#define TWAIFD_TBFBO    (BIT(25))
#define TWAIFD_TBFBO_M  (TWAIFD_TBFBO_V << TWAIFD_TBFBO_S)
#define TWAIFD_TBFBO_V  0x00000001U
#define TWAIFD_TBFBO_S  25
/** TWAIFD_FDRF : R/W; bitpos: [26]; default: 0;
 *  Frame filters drop Remote frames.
 *  0b0 - DROP_RF_DISABLED - Frame filters accept RTR frames.
 *  0b1 - DROP_RF_ENABLED - Frame filters drop RTR frames.
 */
#define TWAIFD_FDRF    (BIT(26))
#define TWAIFD_FDRF_M  (TWAIFD_FDRF_V << TWAIFD_FDRF_S)
#define TWAIFD_FDRF_V  0x00000001U
#define TWAIFD_FDRF_S  26
/** TWAIFD_PCHKE : R/W; bitpos: [27]; default: 0;
 *  Enable Parity checks in TXT Buffers and RX Buffer.
 */
#define TWAIFD_PCHKE    (BIT(27))
#define TWAIFD_PCHKE_M  (TWAIFD_PCHKE_V << TWAIFD_PCHKE_S)
#define TWAIFD_PCHKE_V  0x00000001U
#define TWAIFD_PCHKE_S  27

/** TWAIFD_STATUS_REG register
 *  TWAI FD status register
 */
#define TWAIFD_STATUS_REG (DR_REG_TWAIFD_BASE + 0x8)
/** TWAIFD_RXNE : RO; bitpos: [0]; default: 0;
 *  RX buffer not empty. This bit is 1 when least one frame is stored in RX buffer.
 *  0: empty
 *  1: not empty
 */
#define TWAIFD_RXNE    (BIT(0))
#define TWAIFD_RXNE_M  (TWAIFD_RXNE_V << TWAIFD_RXNE_S)
#define TWAIFD_RXNE_V  0x00000001U
#define TWAIFD_RXNE_S  0
/** TWAIFD_DOR : RO; bitpos: [1]; default: 0;
 *  Data Overrun flag. This bit is set when frame was dropped due to lack of space in
 *  RX buffer. This bit can be
 *  cleared by COMMAND[RRB].
 *  0: not overrun
 *  1: overrun
 */
#define TWAIFD_DOR    (BIT(1))
#define TWAIFD_DOR_M  (TWAIFD_DOR_V << TWAIFD_DOR_S)
#define TWAIFD_DOR_V  0x00000001U
#define TWAIFD_DOR_S  1
/** TWAIFD_TXNF : RO; bitpos: [2]; default: 1;
 *  TXT buffers status. This bit is set if at least one TXT buffer is in "Empty" state.
 *  0: not full
 *  1: full
 */
#define TWAIFD_TXNF    (BIT(2))
#define TWAIFD_TXNF_M  (TWAIFD_TXNF_V << TWAIFD_TXNF_S)
#define TWAIFD_TXNF_V  0x00000001U
#define TWAIFD_TXNF_S  2
/** TWAIFD_EFT : RO; bitpos: [3]; default: 0;
 *  Error frame is being transmitted at the moment.
 *  0: not being transmitted
 *  1: being transmitted
 */
#define TWAIFD_EFT    (BIT(3))
#define TWAIFD_EFT_M  (TWAIFD_EFT_V << TWAIFD_EFT_S)
#define TWAIFD_EFT_V  0x00000001U
#define TWAIFD_EFT_S  3
/** TWAIFD_RXS : RO; bitpos: [4]; default: 0;
 *  CTU CAN FD is receiver of CAN Frame.
 *  0: not receiving
 *  1: receiving
 */
#define TWAIFD_RXS    (BIT(4))
#define TWAIFD_RXS_M  (TWAIFD_RXS_V << TWAIFD_RXS_S)
#define TWAIFD_RXS_V  0x00000001U
#define TWAIFD_RXS_S  4
/** TWAIFD_TXS : RO; bitpos: [5]; default: 0;
 *  CTU CAN FD is transmitter of CAN Frame.
 *  0: not transmitting
 *  1: transmitting
 */
#define TWAIFD_TXS    (BIT(5))
#define TWAIFD_TXS_M  (TWAIFD_TXS_V << TWAIFD_TXS_S)
#define TWAIFD_TXS_V  0x00000001U
#define TWAIFD_TXS_S  5
/** TWAIFD_EWL : RO; bitpos: [6]; default: 0;
 *  TX Error counter (TEC) or RX Error counter (REC) is equal to, or higher than Error
 *  warning limit (EWL).
 *  0: not reached
 *  1: reached
 */
#define TWAIFD_EWL    (BIT(6))
#define TWAIFD_EWL_M  (TWAIFD_EWL_V << TWAIFD_EWL_S)
#define TWAIFD_EWL_V  0x00000001U
#define TWAIFD_EWL_S  6
/** TWAIFD_IDLE : RO; bitpos: [7]; default: 1;
 *  Bus is idle (no frame is being transmitted/received) or CTU CAN FD is bus-off.
 *  0: active
 *  1: not active
 */
#define TWAIFD_IDLE    (BIT(7))
#define TWAIFD_IDLE_M  (TWAIFD_IDLE_V << TWAIFD_IDLE_S)
#define TWAIFD_IDLE_V  0x00000001U
#define TWAIFD_IDLE_S  7
/** TWAIFD_PEXS : RO; bitpos: [8]; default: 0;
 *  Protocol exception status (flag). Set when Protocol exception occurs. Cleared by
 *  writing COMMAND[CPEXS]=1.
 */
#define TWAIFD_PEXS    (BIT(8))
#define TWAIFD_PEXS_M  (TWAIFD_PEXS_V << TWAIFD_PEXS_S)
#define TWAIFD_PEXS_V  0x00000001U
#define TWAIFD_PEXS_S  8
/** TWAIFD_RXPE : RO; bitpos: [9]; default: 0;
 *  Set when parity error is detected during read of CAN frame from RX Buffer via
 *  RX_DATA register.
 */
#define TWAIFD_RXPE    (BIT(9))
#define TWAIFD_RXPE_M  (TWAIFD_RXPE_V << TWAIFD_RXPE_S)
#define TWAIFD_RXPE_V  0x00000001U
#define TWAIFD_RXPE_S  9
/** TWAIFD_TXPE : RO; bitpos: [10]; default: 0;
 *  TXT Buffers Parity Error flag. Set When Parity Error is detected in a TXT Buffer
 *  during transmission from this
 *  Buffer.
 */
#define TWAIFD_TXPE    (BIT(10))
#define TWAIFD_TXPE_M  (TWAIFD_TXPE_V << TWAIFD_TXPE_S)
#define TWAIFD_TXPE_V  0x00000001U
#define TWAIFD_TXPE_S  10
/** TWAIFD_TXDPE : RO; bitpos: [11]; default: 0;
 *  TXT Buffer double parity error. Set in TXT Buffer Backup mode when parity error is
 *  detected in "backup"
 *  TXT Buffer.
 */
#define TWAIFD_TXDPE    (BIT(11))
#define TWAIFD_TXDPE_M  (TWAIFD_TXDPE_V << TWAIFD_TXDPE_S)
#define TWAIFD_TXDPE_V  0x00000001U
#define TWAIFD_TXDPE_S  11
/** TWAIFD_STCNT : RO; bitpos: [16]; default: 1;
 *  Support of Traffic counters. When this bit is 1, Traffic counters are present.
 */
#define TWAIFD_STCNT    (BIT(16))
#define TWAIFD_STCNT_M  (TWAIFD_STCNT_V << TWAIFD_STCNT_S)
#define TWAIFD_STCNT_V  0x00000001U
#define TWAIFD_STCNT_S  16
/** TWAIFD_STRGS : RO; bitpos: [17]; default: 1;
 *  Support of Test Registers for memory testability. When this bit is 1, Test
 *  Registers are present.
 */
#define TWAIFD_STRGS    (BIT(17))
#define TWAIFD_STRGS_M  (TWAIFD_STRGS_V << TWAIFD_STRGS_S)
#define TWAIFD_STRGS_V  0x00000001U
#define TWAIFD_STRGS_S  17
/** TWAIFD_SPRT : RO; bitpos: [18]; default: 1;
 *  Support of Parity protection on each word of TXT Buffer RAM and RX Buffer RAM.
 */
#define TWAIFD_SPRT    (BIT(18))
#define TWAIFD_SPRT_M  (TWAIFD_SPRT_V << TWAIFD_SPRT_S)
#define TWAIFD_SPRT_V  0x00000001U
#define TWAIFD_SPRT_S  18

